
<DOCTYPE HTML>
<html>
<head>
<title>Урок 3.Задание 9 на php</title>
 <body>
 <?php
 function translit ($text) {
     $word = array(
         "а"=>"a",
         "б"=>"b",
         "в"=>"v",
         "г"=>"g",
         "д"=>"d",
         "е"=>"e",
         "ё"=>"e",
         "ж"=>"zh",
         "з"=>"z",
         "и"=>"i",
         "й"=>"i",
         "к"=>"k",
         "л"=>"l",
         "м"=>"m",
         "н"=>"n",
         "о"=>"o",
         "п"=>"p",
         "р"=>"r",
         "с"=>"s",
         "т"=>"t",
         "у"=>"u",
         "ф"=>"f",
         "х"=>"kh",
         "ц"=>"tc",
         "ч"=>"ch",
         "ш"=>"sh",
         "щ"=>"shch",
         "ы"=>"y",
         "э"=>"e",
         "ю"=>"iu",
         "я"=>"ia",
         "ь"=>"",
         "А"=>"A",
         "Б"=>"B",
         "В"=>"V",
         "Г"=>"G",
         "Д"=>"D",
         "Е"=>"E",
         "Ё"=>"E",
         "Ж"=>"ZH",
         "З"=>"Z",
         "И"=>"I",
         "Й"=>"I",
         "К"=>"K",
         "Л"=>"L",
         "Ь"=>"M",
         "Н"=>"N",
         "С"=>"O",
         "П"=>"P",
         "Р"=>"R",
         "С"=>"S",
         "Т"=>"T",
         "У"=>"U",
         "Ф"=>"F",
         "Х"=>"KH",
         "Ц"=>"TC",
         "Ч"=>"CH",
         "Ш"=>"SH",
         "Щ"=>"SHCH",
         "Ы"=>"Y",
         "Э"=>"E",
         "Ю"=>"IU",
         "Я"=>"IA",
         "Ь"=>"",
     );
     return strtr($text, $word);
 }




 function change ($str) {
     $text = array (
         " " => "_",
         "!" => "",
         "?" => "",
         "%" => ""
     );
     return strtr($str, $text);
 }
 echo change(translit("Добро пожаловать в  Geekbrains!"));


 ?>
</body>
</html>