
<DOCTYPE HTML>
<html>
<head>
<title>Урок 3.Задание 8 на php</title>
 <body>
 <?php

 $Russia = array (
     "Московская область" => array ('Одинцово','Красногорск','Мытищи','Королев','Зеленоград','Клин','Раменское','Фрязино'),
     "Ленинградская область" => array ('Колпино','Пушкин','Павловск','Кронштадт'),
     "Сахалинская область" => array ('Южно-Сахалинск','Оха','Невельск','Холмск','Ноглики','Корсаков','Красногорск'),
 );

 foreach ($Russia as $oblast => $city)
 {
      foreach ($city as $key => $value){
          substr($value, 0, 2) != 'К'  ?: print $value .PHP_EOL;

     }

 }


?>
</body>
</html>